In [1]:
import numpy as np
import pandas as pd
Data = {'Names':['Ramesh','Suresh','Satish',np.nan],
       'Age':[np.nan,22,25,27],
       'City':['pune','Pune',np.nan,'Hyd']}

df = pd.DataFrame(Data)
df

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0   NaN
3     NaN  27.0   Hyd

In [2]:
df.to_csv('data_missing.csv',index=False)

In [3]:
pd.read_csv('data_missing.csv')

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0   NaN
3     NaN  27.0   Hyd

In [29]:
import numpy as np
import pandas as pd
Data1 = {'Names':['Ramesh','Suresh','Satish',None],
       'Age':[None,22,25,27],
       'City':['pune','Pune',None,'Hyd']}

df1 = pd.DataFrame(Data1)
df1

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0  None
3    None  27.0   Hyd

In [5]:
df1.to_csv('data_missing1.csv',index=False)

In [6]:
pd.read_csv('data_missing1.csv')

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0   NaN
3     NaN  27.0   Hyd

In [7]:
df.dtypes

Names     object
Age      float64
City      object
dtype: object

In [8]:
df1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
df.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2  False  False   True
3   True  False  False

In [10]:
df1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2  False  False   True
3   True  False  False

In [11]:
df.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [12]:
df1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

**fillna**

In [13]:
df.fillna(30)  # Not recommended

    Names   Age  City
0  Ramesh  30.0  pune
1  Suresh  22.0  Pune
2  Satish  25.0    30
3      30  27.0   Hyd

**What is the difference between np.nan and None**

In [14]:
np.nan+5

nan

In [15]:
None+5

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [ ]:
arr1 = np.array([1,2,np.nan,3])
arr2 = np.array([1,2,None,3])

In [ ]:
arr1

In [16]:
arr2

NameError: name 'arr2' is not defined

In [17]:
np.nansum(arr1),np.sum(arr1)

NameError: name 'arr1' is not defined

In [18]:
np.sum(arr2)

NameError: name 'arr2' is not defined

- np.nan represents float type

- None represents Object type

- if Data opertions related to Maths then nan format is better

- pad

- bfill

- ffill

- backfill

In [19]:
df.fillna(method='pad')

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0  Pune
3  Satish  27.0   Hyd

In [20]:
df1.fillna(method='pad')

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0  Pune
3  Satish  27.0   Hyd

In [21]:
df.fillna(method='bfill')

    Names   Age  City
0  Ramesh  22.0  pune
1  Suresh  22.0  Pune
2  Satish  25.0   Hyd
3     NaN  27.0   Hyd

In [22]:
df1.fillna(method='bfill')

    Names   Age  City
0  Ramesh  22.0  pune
1  Suresh  22.0  Pune
2  Satish  25.0   Hyd
3    None  27.0   Hyd

In [23]:
df.fillna(method='ffill')

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0  Pune
3  Satish  27.0   Hyd

In [24]:
df1.fillna(method='ffill')

    Names   Age  City
0  Ramesh   NaN  pune
1  Suresh  22.0  Pune
2  Satish  25.0  Pune
3  Satish  27.0   Hyd

In [25]:
df.fillna(method='backfill')

    Names   Age  City
0  Ramesh  22.0  pune
1  Suresh  22.0  Pune
2  Satish  25.0   Hyd
3     NaN  27.0   Hyd

In [26]:
df1.fillna(method='backfill')

    Names   Age  City
0  Ramesh  22.0  pune
1  Suresh  22.0  Pune
2  Satish  25.0   Hyd
3    None  27.0   Hyd

In [27]:
df.fillna(method='pad',axis=1)

    Names     Age  City
0  Ramesh  Ramesh  pune
1  Suresh    22.0  Pune
2  Satish    25.0  25.0
3     NaN    27.0   Hyd

In [ ]:
- idea-1 : filling with random value = df.fillname(<random value>)  
    
    
- idea-2 : filling with  rv based on column=df[<col>].fillname(<rv>)
    
    
- idea-3 : filling with some pattern using a method: df.fillna(<method>)
    
    
- idea-4 : filling with m-m-m based on column=df[<col>].fillname(<m>or<m>or<m>)
    
    
- idea-5 : filling with avg value only selected neighbours

**Mean-Median-Mode**

In [30]:
age_mean = data1['Age'].mean()
print('age_mmean:',age_mean)
data1['Age']

NameError: name 'data1' is not defined

# **KNN immputer**

- K- Nearest Neighbours


- Where k = hyper parameter which means the user can change


- Idea: Instead of taking all the samples average

    - First fix the neighbours number i.e. k    
    
    - Then find the neighbours using distance metric    
    
    - Then take the average of those samepls to fill missing value

In [39]:
import numpy as np
from sklearn.impute import KNNImputer
x = [[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
pd.DataFrame(x)

     0     1    2
0  1.0   2.0  NaN
1  3.0   NaN  3.0
2  NaN  60.0  5.0
3  8.0   8.0  7.0

In [41]:
KNNImputer().fit_transform(x)  # here weight is uniform

array([[ 1.        ,  2.        ,  5.        ],
       [ 3.        , 23.33333333,  3.        ],
       [ 4.        , 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])

In [42]:
immputer = KNNImputer(n_neighbors=2,weights='distance')
immputer.fit_transform(x)

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])

In [ ]:
- idea-1 : filling with random value = df.fillname(<random value>)  
    
    
- idea-2 : filling with  rv based on column=df[<col>].fillname(<rv>)
    
    
- idea-3 : filling with some pattern using a method: df.fillna(<method>)
    
    
- idea-4 : filling with m-m-m based on column=df[<col>].fillname(<m>or<m>or<m>)
    
    
- idea-5 : filling with avg value only selected neighbours
    

- idea-6 : filling with a value based on crrelation withh another columns